core/app/Controllers/Admin/Scenes.php

    public function delete($id)
    {
        $scene = $this->sceneModel->find($id);
        if ($scene['image'] != 'default.jpg') {
            unlink('uploads/' . $scene['image']);
        }
        $this->sceneModel->delete($id);
---
SELECT *
FROM `scenes`
WHERE `scenes`.`id` = '10'
DELETE FROM `scenes`
WHERE `id` IN ('10')